import Head from "next/head"

// TODO move texts into i18n data
/* eslint-disable react/no-unescaped-entities */

export default function Who() {
  return (
    <div>
      <Head>
        <title>נקודות התרמה</title>
      </Head>
      פתיח
      תורמ/ת דן נכבד/ת,
      אנו מודים לך על נכונותך לתרום דם.

      הטופס שלפניך יסייע לך לוודא שהינך עומד/ת בקריטריונים של תרומת דם. הקריטריונים נקבעו על ידי מד"א. טופס זה הינו טופס ראשוני בלבד, במידה ותימצא מתאים יהיה עליך למלא הצהרת בריאות, ולעבור בדיקה נוספת (לחץ דם, והמוגלובין) בעמדת ההתרמה.

      טופס זה מבוסס על טופס מד"א "שאלון תורם דם" ובכל מקרה נציג מד"א הינו הקבוע סופית לגבי התאמתו או אי-התאמתו של תורם דם.

      מין
      מהו מינך?
      זכר
      נקבה
      מהו גילך?
      לוגיקה: 
            אם מתחת ל-17 ➔ עמוד סיום: לא יכול לתרום בשל גיל צעיר מדי
            אם מתחת ל-18 ➔ התראה: שים לב, הנך מחויב בהצהרת הורים, קישור להצהרת הורים/אפוטרופוס יופיע בעמוד האחרון של הטופס (להוסיף קישור לטופס מד"א בעמוד הסופי). ממשיך.
            אם מגיל 18-59 ➔ ממשיך.
            אם מגיל 60-64 ➔ האם זוהי תרומת הדם הראשונה שלך? ➔ אם כן ➔ התראה: שים לב, ידרש אישור מהרופא המטפל לעמידה במדדים לקבלת תורמים. ממשיך. (להראות את ההתראה גם בעמוד הסיום).
            אם מגיל 65 ➔ התראה: שים לב, ידרש אישור מהרופא המטפל לעמידה במדדים לקבלת תורמים, וכן קריטריונים נוספים באתר ההתרמה. ממשיך. (להראות את ההתראה גם בעמוד הסיום, כולל להציג ווטסאפ לעמותת מתנדבים תורמי דם לווידוא התאמת עמדת ההתרמה).
      מתי תרמת דם בפעם האחרונה?
      [נקודה למחשבה: מה מושכים מתוך הנתונים הקיימים on device ואיך להציג]
            אם תרם ב-3 חודשים האחרונים ➔ עמוד סיום: המינימום בין תרומות דם על פי קריטריוני מד"א הינו שלושה חודשים לפחות. אין באפשרותך לתרום דם כעת.

      מה המשקל שלך?
            אם מתחת ל-50 ק"ג ➔ עמוד סיום: אין באפשרותך לתרום, מתן תרומת דם עשוי לסכן את בריאותך.
            [אם אשה] האם הינך בהריון כעת?
            אם כן ➔ עמוד סיום: אין באפשרותך לתרום כעת. מתן תרומת דם עשוי לסכן את בריאותך.
            אם לא ➔ ממשיכה.
                
            [אם אשה] האם ילדת בחצי השנה האחרונה?
            אם כן ➔ עמוד סיום: אין באפשרותך לתרום כעת. מתן תרומת דם עשוי לסכן את בריאותך.
            אם לא ➔ ממשיכה.
      האם הינך סובל מאחד מהמצבים הבאים?
      בעיה לבבית או הפרעות בקצב הלב הדורשות טיפול תרופתי, המופיליה או מחלת הנפילה (אפילפסיה) המטופלת בטיפול תרופתי או שחוו התקף ב-5 השנים האחרונות.

            אם כן ➔ עמוד סיום: אין באפשרותך לתרום. מתן תרומת דם עשויה לסכן את בריאותך.
            אם לא ➔ ממשיך.
      האם טופלת באנטיביוטיקה בחודש האחרון?
            כן, סיימתי את הטיפול והחלמתי מהמחלה ➔ ממשיך
            כן, טרם סיימתי את הטיפול ואני עדיין נוטל אנטיביוטיקה / לא החלמתי ➔ עמוד סיום: אין באפשרותך לתרום כעת, עליך לסיים את הטיפול לפני מתן תרומת דם.
            לא ➔ ממשיך
      האם עברת טיפול שיניים לאחרונה?
      האם עברת אחד או יותר מהטיפולים הבאים: שיננית ב-24 שעות האחרונות, טיפול שורש/עקירת שן בשבוע האחרון, השתלת שיניים בחודש האחרון.
            כן ➔ מסיים. עמוד סיום: לא ניתן לתרום דם לאחר טיפול שיננית לפני שחלפו 24 שעות מהטיפול / …
            לא ➔ ממשיך.
      האם הינך חולה בדלקת כבד (צהבת)?
            כן, סוג A ➔ יכול לתרום שנה לאחר ההחלמה.
            כן, סוג B או C ➔ לא יכול לתרום (מסכן את מקבל התרומה).
            כן, מסיבה לא ידועה ➔ יכול לתרום אם חלפו שנתיים מההחלמה.
      האם קיבלת חיסון לאחרונה?
      האם קיבלת חיסון לאחת מהמחלות הבאות בחודש האחרון: אדמת, חצבת, חזרת, אבעבעות רוח, קדחת צהובה? 
            לא ➔ ממשיך.
            כן ➔ עמוד סיום: לא יכול לתרום (מסכן את מקבל התרומה).
      האם הינך חולה באסטמה?
            כן ➔ לוודא שהתקף אחרון לפני יותר משבוע, שמרגיש טוב, ושאינו נוטל סטרואידים בכדורים.
            לא ➔ ממשיך.
      האם הינך חולה בסכרת?
            לא ➔ ממשיך
            כן, מאוזנת על ידי דיאטה או תרופות ➔ ממשיך
            כן, מטופל באינסולין ➔ עמוד סיום: לא יכול לתרום.
      האם הינך חולה או שחלית בעבר במחלה ממאירה?
            כן, מחלה או היסטוריה של מחלה ממאירה המטולוגית או המושרית על ידי וירוסים (לויקמיה, לימפומה, מחלת הודג'קין. ➔ מועבר לעמוד סיום - לא יכול לתרום.
            כן, גידולים אחרים ➔ חלפו 5 שנים לאחר השלמת הטיפול והחלמה מלאה ➔ ממשיך.
            לא ➔ ממשיך.
      האם יש לך אנמיה או נטיה לדמם?
            כן ➔ עמוד סיום
            לא ➔ ממשיך
      האם קיבלת עירוי דם או מרכיבי דם?
            כן, ב-4 חודשים האחרונים ➔ עמוד סיום
            כן, לפני יותר מ-4 חודשים ➔ ממשיך
            לא ➔ ממשיך
      האם ביצעת כתובת קעקע, פירסינג, איפור קבוע, אנדוסקופיה עם ביופסיה?
            כן, ב-4 חודשים האחרונים ➔ עמוד סיום
            כן, לפני יותר מ-4 חודשים ➔ ממשיך
            לא ➔ ממשיך
      האם ביקרת בשנה האחרונה באחת מהמדינות הבאות?
      (להציג רשימת מדינות אנדמיות למלריה, לקחת מתוך ה-JSON של מדינות איפה שרשום מלריה)
            כן ➔ עמוד סיום
            לא ➔ ממשיך

      האם שהית תקופה של מעל 6 חודשים באחת מהמדינות הבאות?
      (להציג רשימה של מדינות שבהם מלריה נפוצה או תחלואה במלריה)

            כן, ב-3 השנים האחרונות ➔ עמוד סיום
            כן, לפני יותר מ-3 שנים ➔ ממשיך
            לא ➔ ממשיך

      האם שהית או ביקרת באחת מהמדינות הבאות?
      (להציג רשימה של מדינות עם שכיחות גבוהה לאיידס)
            כן, בשלושת החודשים האחרונים ➔ עמוד סיום
            כן, לפני יותר משלושה חודשים ➔ ממשיך
            לא ➔ ממשיך

      האם קיימת יחסי מין בסיכון גבוה להידבקות במחלות אשר עלולות לעבור בעירוי (יחסים אנאליים ו/או בהשפעת סמים) עם שותף/ה חדש/ה או שותפים מרובים?
            כן, ב-3 החודשים האחרונים ➔ עמוד סיום. לא יכול לתרום.
            כן, לפני יותר מ-3 חודשים ➔ ממשיך.
            לא ➔ ממשיך.
    </div>
  )
}
